Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA1_DFP/2.4.81/samha1ab/edc/ATSAMHA1G16AB.PIC
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="CRCCHKSUM" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41004808">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="CRCCHKSUM" edc:nzwidth="0x20" edc:desc="CRC Checksum"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="CRCSTATUS" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x4100480C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="CRCBUSY" edc:nzwidth="0x1" edc:desc="CRC Module Busy"/>
            <edc:SFRFieldDef edc:cname="CRCZERO" edc:nzwidth="0x1" edc:desc="CRC Zero"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="DBGCTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x4100480D">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:nzwidth="0x1" edc:desc="Debug Run"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="QOSCTRL" edc:nzwidth="0x8" edc:access="--nnnnnn" edc:por="00010101" edc:mclr="00010101" edc:impl="0x3F" edc:_addr="0x4100480E">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="WRBQOS" edc:nzwidth="0x2" edc:desc="Write-Back Quality of Service">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Background (no sensitive operation)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Sensitive Bandwidth" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MEDIUM" edc:desc="Sensitive Latency" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Critical Latency" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FQOS" edc:nzwidth="0x2" edc:desc="Fetch Quality of Service">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Background (no sensitive operation)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Sensitive Bandwidth" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MEDIUM" edc:desc="Sensitive Latency" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Critical Latency" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DQOS" edc:nzwidth="0x2" edc:desc="Data Transfer Quality of Service">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Background (no sensitive operation)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Sensitive Bandwidth" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MEDIUM" edc:desc="Sensitive Latency" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Critical Latency" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x4100480F"/>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="SWTRIGCTRL" edc:nzwidth="0x20" edc:access="--------------------nnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFF" edc:_addr="0x41004810">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="SWTRIG0" edc:nzwidth="0x1" edc:desc="Channel 0 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG1" edc:nzwidth="0x1" edc:desc="Channel 1 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG2" edc:nzwidth="0x1" edc:desc="Channel 2 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG3" edc:nzwidth="0x1" edc:desc="Channel 3 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG4" edc:nzwidth="0x1" edc:desc="Channel 4 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG5" edc:nzwidth="0x1" edc:desc="Channel 5 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG6" edc:nzwidth="0x1" edc:desc="Channel 6 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG7" edc:nzwidth="0x1" edc:desc="Channel 7 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG8" edc:nzwidth="0x1" edc:desc="Channel 8 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG9" edc:nzwidth="0x1" edc:desc="Channel 9 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG10" edc:nzwidth="0x1" edc:desc="Channel 10 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG11" edc:nzwidth="0x1" edc:desc="Channel 11 Software Trigger"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="PRICTRL0" edc:nzwidth="0x20" edc:access="n---nnnnn---nnnnn---nnnnn---nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x8F8F8F8F" edc:_addr="0x41004814">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="LVLPRI0" edc:nzwidth="0x4" edc:desc="Level 0 Channel Priority Number"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RRLVLEN0" edc:nzwidth="0x1" edc:desc="Level 0 Round-Robin Scheduling Enable"/>
            <edc:SFRFieldDef edc:cname="LVLPRI1" edc:nzwidth="0x4" edc:desc="Level 1 Channel Priority Number"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RRLVLEN1" edc:nzwidth="0x1" edc:desc="Level 1 Round-Robin Scheduling Enable"/>
            <edc:SFRFieldDef edc:cname="LVLPRI2" edc:nzwidth="0x4" edc:desc="Level 2 Channel Priority Number"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RRLVLEN2" edc:nzwidth="0x1" edc:desc="Level 2 Round-Robin Scheduling Enable"/>
            <edc:SFRFieldDef edc:cname="LVLPRI3" edc:nzwidth="0x4" edc:desc="Level 3 Channel Priority Number"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RRLVLEN3" edc:nzwidth="0x1" edc:desc="Level 3 Round-Robin Scheduling Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x41004818"/>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="INTPEND" edc:nzwidth="0x10" edc:access="nnn--nnn----nnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xE70F" edc:_addr="0x41004820">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="ID" edc:nzwidth="0x4" edc:desc="Channel ID"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TERR" edc:nzwidth="0x1" edc:desc="Transfer Error"/>
            <edc:SFRFieldDef edc:cname="TCMPL" edc:nzwidth="0x1" edc:desc="Transfer Complete"/>
            <edc:SFRFieldDef edc:cname="SUSP" edc:nzwidth="0x1" edc:desc="Channel Suspend"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FERR" edc:nzwidth="0x1" edc:desc="Fetch Error"/>
            <edc:SFRFieldDef edc:cname="BUSY" edc:nzwidth="0x1" edc:desc="Busy"/>
            <edc:SFRFieldDef edc:cname="PEND" edc:nzwidth="0x1" edc:desc="Pending"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x41004822"/>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="INTSTATUS" edc:nzwidth="0x20" edc:access="--------------------rrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFF" edc:_addr="0x41004824">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="CHINT0" edc:nzwidth="0x1" edc:desc="Channel 0 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT1" edc:nzwidth="0x1" edc:desc="Channel 1 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT2" edc:nzwidth="0x1" edc:desc="Channel 2 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT3" edc:nzwidth="0x1" edc:desc="Channel 3 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT4" edc:nzwidth="0x1" edc:desc="Channel 4 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT5" edc:nzwidth="0x1" edc:desc="Channel 5 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT6" edc:nzwidth="0x1" edc:desc="Channel 6 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT7" edc:nzwidth="0x1" edc:desc="Channel 7 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT8" edc:nzwidth="0x1" edc:desc="Channel 8 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT9" edc:nzwidth="0x1" edc:desc="Channel 9 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT10" edc:nzwidth="0x1" edc:desc="Channel 10 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT11" edc:nzwidth="0x1" edc:desc="Channel 11 Pending Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="BUSYCH" edc:nzwidth="0x20" edc:access="--------------------rrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFF" edc:_addr="0x41004828">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="BUSYCH0" edc:nzwidth="0x1" edc:desc="Busy Channel 0"/>
            <edc:SFRFieldDef edc:cname="BUSYCH1" edc:nzwidth="0x1" edc:desc="Busy Channel 1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH2" edc:nzwidth="0x1" edc:desc="Busy Channel 2"/>
            <edc:SFRFieldDef edc:cname="BUSYCH3" edc:nzwidth="0x1" edc:desc="Busy Channel 3"/>
            <edc:SFRFieldDef edc:cname="BUSYCH4" edc:nzwidth="0x1" edc:desc="Busy Channel 4"/>
            <edc:SFRFieldDef edc:cname="BUSYCH5" edc:nzwidth="0x1" edc:desc="Busy Channel 5"/>
            <edc:SFRFieldDef edc:cname="BUSYCH6" edc:nzwidth="0x1" edc:desc="Busy Channel 6"/>
            <edc:SFRFieldDef edc:cname="BUSYCH7" edc:nzwidth="0x1" edc:desc="Busy Channel 7"/>
            <edc:SFRFieldDef edc:cname="BUSYCH8" edc:nzwidth="0x1" edc:desc="Busy Channel 8"/>
            <edc:SFRFieldDef edc:cname="BUSYCH9" edc:nzwidth="0x1" edc:desc="Busy Channel 9"/>
            <edc:SFRFieldDef edc:cname="BUSYCH10" edc:nzwidth="0x1" edc:desc="Busy Channel 10"/>
            <edc:SFRFieldDef edc:cname="BUSYCH11" edc:nzwidth="0x1" edc:desc="Busy Channel 11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="PENDCH" edc:nzwidth="0x20" edc:access="--------------------rrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFF" edc:_addr="0x4100482C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="PENDCH0" edc:nzwidth="0x1" edc:desc="Pending Channel 0"/>
            <edc:SFRFieldDef edc:cname="PENDCH1" edc:nzwidth="0x1" edc:desc="Pending Channel 1"/>
            <edc:SFRFieldDef edc:cname="PENDCH2" edc:nzwidth="0x1" edc:desc="Pending Channel 2"/>
            <edc:SFRFieldDef edc:cname="PENDCH3" edc:nzwidth="0x1" edc:desc="Pending Channel 3"/>
            <edc:SFRFieldDef edc:cname="PENDCH4" edc:nzwidth="0x1" edc:desc="Pending Channel 4"/>
            <edc:SFRFieldDef edc:cname="PENDCH5" edc:nzwidth="0x1" edc:desc="Pending Channel 5"/>
            <edc:SFRFieldDef edc:cname="PENDCH6" edc:nzwidth="0x1" edc:desc="Pending Channel 6"/>
            <edc:SFRFieldDef edc:cname="PENDCH7" edc:nzwidth="0x1" edc:desc="Pending Channel 7"/>
            <edc:SFRFieldDef edc:cname="PENDCH8" edc:nzwidth="0x1" edc:desc="Pending Channel 8"/>
            <edc:SFRFieldDef edc:cname="PENDCH9" edc:nzwidth="0x1" edc:desc="Pending Channel 9"/>
            <edc:SFRFieldDef edc:cname="PENDCH10" edc:nzwidth="0x1" edc:desc="Pending Channel 10"/>
            <edc:SFRFieldDef edc:cname="PENDCH11" edc:nzwidth="0x1" edc:desc="Pending Channel 11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="ACTIVE" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrr--rrrrr----rrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF9F0F" edc:_addr="0x41004830">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="LVLEX0" edc:nzwidth="0x1" edc:desc="Level 0 Channel Trigger Request Executing"/>
            <edc:SFRFieldDef edc:cname="LVLEX1" edc:nzwidth="0x1" edc:desc="Level 1 Channel Trigger Request Executing"/>
            <edc:SFRFieldDef edc:cname="LVLEX2" edc:nzwidth="0x1" edc:desc="Level 2 Channel Trigger Request Executing"/>
            <edc:SFRFieldDef edc:cname="LVLEX3" edc:nzwidth="0x1" edc:desc="Level 3 Channel Trigger Request Executing"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ID" edc:nzwidth="0x5" edc:desc="Active Channel ID"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ABUSY" edc:nzwidth="0x1" edc:desc="Active Channel Busy"/>
            <edc:SFRFieldDef edc:cname="BTCNT" edc:nzwidth="0x10" edc:desc="Active Channel Block Transfer Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="BASEADDR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41004834">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="BASEADDR" edc:nzwidth="0x20" edc:desc="Descriptor Memory Base Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
